УНФ_ТЕСТ/src/InformationRegisters/СостоянияСинхронизацииТорговыеПредложения/СостоянияСинхронизацииТорговыеПредложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияСинхронизацииТорговыеПредложения</name>
  <comment>Настройки и состояния публикуемых торговых предложений в сервисе 1С:Бизнес-сеть</comment>
  <resources>
    <name>ДатаСинхронизации</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияСинхронизацииТорговыеПредложения</types>
    </type>
  </resources>
  <resources>
    <name>ДействиеСинхронизации</name>
    <type>
      <types>EnumRef.ДействияСинхронизацииТорговыеПредложения</types>
    </type>
  </resources>
  <resources>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отключено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Хеш</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УведомлятьОЗаказах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьКартинки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПубликоватьЦены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПубликоватьСрокиПоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПубликоватьОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОпубликованных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПубликоватьРегионыДоступностиТоваров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегионыДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РегионыСамовывоза</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТорговоеПредложение</name>
    <type>
      <types>DefinedType.ТорговоеПредложение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УНФ_ТЕСТ/src/InformationRegisters/СостоянияСинхронизацииТорговыеПредложения/Forms/НастройкиПубликации/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ТорговыеПредложения.ПравоНастройкиТорговыхПредложений(Истина) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
		
	Если Не Параметры.ТорговоеПредложение.Пустая() Тогда
		
		СвойстваПредложения = Новый Структура("Организация, Валюта");
		ТорговыеПредложенияПереопределяемый.ПолучитьСвойстваТорговогоПредложения(Параметры.ТорговоеПредложение, СвойстваПредложения);
		
		ТекущаяЗапись = ТорговыеПредложенияСлужебный.ЗаписьСостояниеСинхронизации(
			СвойстваПредложения.Организация, 
			Параметры.ТорговоеПредложение);
		
		Если ТекущаяЗапись = Неопределено Тогда
			Отказ = Истина;
		Иначе
			ЗначениеВРеквизитФормы(ТекущаяЗапись, "Запись");
		КонецЕсли;

	КонецЕсли;
	
	УстановитьВидимостьДоступность(Запись, Элементы);
	
	УстановитьЗаголовокСсылкиОткрытияАдресов();
	
	// Установка видимости публикации остатков в прикладном решении.
	ТорговыеПредложенияПереопределяемый.ВыгружатьОтносительныеОстаткиТоваров(Элементы.ПубликоватьОстатки.Видимость);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьЗаголовокСсылкиОткрытияАдресов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Запись.УведомлятьОЗаказах Тогда
		Если ПустаяСтрока(Запись.АдресЭлектроннойПочты) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Введите адрес электронной почты'"), , "АдресЭлектроннойПочты", , Отказ);
		ИначеЕсли Не ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(Запись.АдресЭлектроннойПочты, Истина) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Адрес электронной почты введен неверно'"), , "АдресЭлектроннойПочты", , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Запись.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияСинхронизацииТорговыеПредложения.ТребуетсяСинхронизация");
	
	ЗначенияЗаписи = Новый Структура;
	ЗначенияЗаписи.Вставить("ТорговоеПредложение"                  , Запись.ТорговоеПредложение);
	ЗначенияЗаписи.Вставить("Организация"                          , Запись.Организация);
	ЗначенияЗаписи.Вставить("АдресЭлектроннойПочты"                , Запись.АдресЭлектроннойПочты);
	ЗначенияЗаписи.Вставить("УведомлятьОЗаказах"                   , Запись.УведомлятьОЗаказах);
	ЗначенияЗаписи.Вставить("ПубликоватьОстатки"                   , Запись.ПубликоватьОстатки);
	ЗначенияЗаписи.Вставить("ПубликоватьСрокиПоставки"             , Запись.ПубликоватьСрокиПоставки);
	ЗначенияЗаписи.Вставить("ПубликоватьЦены"                      , Запись.ПубликоватьЦены);
	ЗначенияЗаписи.Вставить("ДополнительноеОписание"               , Запись.ДополнительноеОписание);
	Оповестить("ТорговыеПредложения_ЗаписьДополнительныеНастройки" , ЗначенияЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОповеститьОбИзменении(Запись.ТорговоеПредложение);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Запись.ПубликоватьРегионыДоступностиТоваров
		И Не ЗначениеЗаполнено(Запись.РегионыДоставки)
		И Не ЗначениеЗаполнено(Запись.РегионыСамовывоза) Тогда
		
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заполнены регионы доступности товаров'"));	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УведомлятьОЗаказахПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность(Запись, Элементы)
	
КонецПроцедуры

&НаКлиенте
Процедура СоставРегионовНажатие(Элемент)
	
	ПараметрыФормы = БизнесСетьСлужебныйКлиент.ОписаниеПараметровФормыНастройкиРегионов();
	
	ПараметрыФормы.Организация         = Запись.Организация;
	ПараметрыФормы.ТорговоеПредложение = Запись.ТорговоеПредложение;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораАдресов", ЭтотОбъект);
		
	БизнесСетьСлужебныйКлиент.ОткрытьФормуНастройкиРегионов(ПараметрыФормы, ЭтотОбъект, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПубликоватьРегионыПриИзменении(Элемент)
	
	Элементы.СоставРегионов.Доступность = Запись.ПубликоватьРегионыДоступностиТоваров;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьДоступность(Запись, Элементы)
	
	Элементы.АдресЭлектроннойПочты.Доступность               = Запись.УведомлятьОЗаказах;
	Элементы.АдресЭлектроннойПочты.АвтоОтметкаНезаполненного = Элементы.АдресЭлектроннойПочты.Доступность;
	Элементы.СоставРегионов.Доступность                      = Запись.ПубликоватьРегионыДоступностиТоваров;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораАдресов(Результат, ДополнительныеПараметры) Экспорт

	УстановитьЗаголовокСсылкиОткрытияАдресов(Истина);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокСсылкиОткрытияАдресов(ПеречитатьДанные = Ложь)
	
	Если ПеречитатьДанные Тогда
		ТекущаяЗапись = ТорговыеПредложенияСлужебный.ЗаписьСостояниеСинхронизации(Запись.Организация, Запись.ТорговоеПредложение);
		ЗаполнитьЗначенияСвойств(Запись, ТекущаяЗапись, "РегионыДоставки, РегионыСамовывоза");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.РегионыДоставки)
		ИЛИ ЗначениеЗаполнено(Запись.РегионыСамовывоза) Тогда
		
		Элементы.СоставРегионов.Заголовок = НСтр("ru = 'Изменить'");
	Иначе
		Элементы.СоставРегионов.Заголовок = "<" + НСтр("ru = 'не указаны'") + ">";
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
